["Walmart, El Salvador and Mastercard: A new episode of \"CoinDesk Breaks It Down\" explains the week's top news on @Snapchat.\n\nWatch: https://t.co/Imi8jWs6hv https://t.co/qn8ZF8uICU", "The Launch of the OnChain Monkey 10,000 Part NFT Collection with legendary investor Bill Tai and Co-Founder of Nfinita, Danny Yang. Uniquely, the collection was created in a single transaction. @KiteVC @huuep @mikejcasey @sheila_warren \n\nhttps://t.co/Cv6zQrTiYk https://t.co/zpnlGCjkUl", "CORRECTION: .@opensea acknowledged that someone at the company was flipping NFTs, but didn’t name @natechastain, who has resigned. CoinDesk’s previous tweet mistakenly gave the Twitter handle of a parody account as Chastain’s.\n\nby @lil_smush \n\nhttps://t.co/YufkRi3KsT", "Today, metaverses like @decentraland and @TheSandboxGame are where you play a quick game, browse NFTs in an art gallery or have a meetup. \n\nIn 10 or 20 years, perhaps the metaverse replaces much of what you do online, or even offline, says @jeffwilser. \n\nhttps://t.co/kUYGXPWVk6 https://t.co/l9bY4RIbOU", "The @Lightning Network is either characterized as ready to fix all of Bitcoin’s scaling problems or best set aside for some other coin to act as peer-to-peer cash. \n\nReality lies somewhere between.\n\nIn-depth report by @gckaloudis:\nhttps://t.co/kUTGAQ5DuU https://t.co/rlPdjoD10I", ".@CelsiusNetwork’s @Mashinsky says he welcomes the chance to educate U.S. securities regulators.\n\n“They should be cheering for us as we’re effectively helping redistribute wealth and provide opportunity for everybody, not just the 1%.”\n\nhttps://t.co/5Br0nvNAq4 https://t.co/Zgtjf8SoXn", "\"The crypto industry at large has been interested in looking for regulatory clarity,\" @nathanmccauley of @Anchorage told CoinDesk TV at @SALTconference in New York.\n\nWatch the full spotlight, sponsored by @NexoFinance: https://t.co/3X9cQWvVwI https://t.co/BKANhVvi4D", "\"Don't hold me to it, but ... I could see it doubling, if not more,\" Charles Allen, CEO of @BitcoinShopUS, says of #Ethereum after the ETH 2.0 upgrade.\n\nWatch the full markets segment on BTCS' bullishness for Ethereum, sponsored by @Grayscale: https://t.co/zJWmxpdF29 https://t.co/9FEwG2aksK", "Yes, we've still got RSS. Here's how to stay on top of CoinDesk stories as they're published: https://t.co/I6PRg0Lxf5", "@oraclite Why, yes:\n\nhttps://t.co/76vKXDlJ8N", "Nils Andersen-Röed will conduct “internal and external investigations” to identify individuals who are trying to use the @Binance platform for illegal purposes.\n\nJPRubin23 reports\n\nhttps://t.co/ZQRBynkLE7 https://t.co/J7AZ0N8ALe", "The Alabama Securities Commission filed a show-cause order to @CelsiusNetwork, giving the crypto firm four weeks to explain how it is not violating state securities laws.\n\n@nikhileshde @realDannyNelson report\n\nhttps://t.co/qu2eNPVREr", "Over the past 20 months, bitcoin transaction fees at times have been relatively cheap - less than $0.05 per transaction. \n\nThey peaked as #bitcoin reached all-time highs in the second quarter.\n\nWatch Chart of the Day, sponsored by @cryptocom: https://t.co/7PBF6aWzvv https://t.co/rMc72WA1Nv", ".@ChristiesInc to list @MyCurioCards, @artblocks_io NFTs in its first $ETH-based auction. \n\n@0x_bae reports\n\nhttps://t.co/CGDfATQQ0b https://t.co/9J3Ir10hxt", "The @USTreasury Department plans to roll out guidance and sanctions next week to tamp down on ransomware payments.\n\n@nikhileshde reports\n\nhttps://t.co/Z8pqIMQCli", "Bakkt Holdings and VIH have received SEC approval to complete their merger and move forward with plans to operate as a single publicly traded entity. \n@JPRubin23 reports\nhttps://t.co/oSdf51Tmfa https://t.co/SIVXdXo1xm", "The former head of Russian crypto exchange WEX has been arrested in Warsaw, according to a report.\n\nBy @Nate_DiCamillo\n\nhttps://t.co/KX5RrklvFv https://t.co/KGt3bi29qB", "U.S. investigators are reportedly looking into insider trading allegations at Binance, adding to an ongoing probe of the world's biggest exchange.\n\n@realDannyNelson @nikhileshde report \n\nhttps://t.co/mmalxqGqq4", ".@Apple is being sued by users who allege that a fake wallet app called Toast Plus was used to swindle them out of over $5 million in crypto holdings.\n@cheyenneligon reports\nhttps://t.co/hfYjB4Qgvg https://t.co/oa1hVzfngt", "MARKET WRAP: Bitcoin $BTC slips as regulatory concerns rise; altcoins outperformed this week.\n\nhttps://t.co/i2sAAjF8k3", "Kia Sedonas, miso soup and the FBI: An inside look at perhaps the most bizarre hack in crypto history.\n\n@Blockanalia reports\n\nhttps://t.co/pqwB8To1H6 https://t.co/PQezZUL1mb", "RT @borgetsebastien: We're all explorers of this brave new world.\n\nThe Metaverse is the new frontier for mankind. New jobs, value and wealt…", "RT @jeffwilser: \"The mission of my art was always to showcase women, and put them in the spotlight, and bring more diversity into the space…", "RT @nic__carter: My latest in @CoinDesk: reflections on the politics of blockchain engineering choices, with a focus on EIP1559\n\nhttps://t.…", "RT @mikejcasey: It can feel like crypto is always in a semi-permanent state of bubble and hype. I think that's a feature, not a bug. \n\nThis…", "\"Speculation Is Good (for Crypto)\"\n\n\"Prices will fluctuate and the mainstream media will continue to point that out to the outside world. But it’s all part of the process. There is no straight-line route to where we are going.\"\n\nOpinion @mikejcasey \n\nhttps://t.co/Hy3xd0KE3U https://t.co/yFVuaix3Vf", "LIVE: Our week in review panel wraps up this week in #bitcoin.\n\nWatch \"All About Bitcoin\" on https://t.co/yHMYaDyzNy: https://t.co/4FP5BUib0O", "Tether's denial that it holds Evergrande debt doesn't mean the stablecoin is protected from the Chinese developer's looming collapse.\n\nOpinion for the Node newsletter @DavidZMorris \n\nhttps://t.co/sNUPXuZKmv https://t.co/VraI3P0RJC", "LATEST: Following enforcement actions from Texas and New Jersey, @CelsiusNetwork CEO Alex @Mashinsky says his crypto lending firm wants to help U.S. regulators \"learn more about what we do.\"\n\n@realDannyNelson reports\n\nhttps://t.co/y46DbsIbPR https://t.co/fn4ZhL1PeW", ".@HuobiGlobal, one of the world’s largest crypto exchanges, burned over $35 million worth of its tokens in August.\n\n@EliTanjourno reports\n\nhttps://t.co/FoJSA1xHSi https://t.co/2WmZNS0ARW", "The Launch of the OnChain Monkey 10,000 Part NFT Collection with legendary investor Bill Tai and Co-Founder of Nfinita, Danny Yang. Uniquely, the collection was created in a single transaction.\n@KiteVC @huuep @sheila_warren @mikejcasey \n\nhttps://t.co/dFVj9c534n https://t.co/SUtMjulJsQ", "\"Ethereum’s Design Choices Are Inherently Political\"\n\n@nic__carter: \"EIP 1559 may well have been sound engineering .... However, its largely unacknowledged externality – the redistribution of fees from miners to token holders – is troublesome.\"\n\nOpinion.\n\nhttps://t.co/xoq0oEEgQO https://t.co/D5JiMrf05Z", "JUST IN: Just hours after securities regulators in Texas served crypto lender @CelsiusNetwork with an order to appear in court, New Jersey has filed a cease-and-desist on similar allegations.\n\n@zackseward reports\n\nhttps://t.co/6xzIZdhF4x https://t.co/026wuYVHsw", "RT @realDannyNelson: “We are simply trying to get Celsius in compliance with the law,” TSSB enforcement director Joe Rotunda tells CoinDesk.", "Crypto lobbying group @alliance_pos is calling attention to a little-discussed provision in the infrastructure bill that could require people to report sensitive personal information tied to peer-to-peer crypto transactions. \n\n@cheyenneligon reports\n\nhttps://t.co/8Bgd4ij1tP https://t.co/Ccw18P6msI", ".@FTX_Official-owned crypto derivatives exchange @ZubrExchange has been approved in Gibraltar to operate as a distributed ledger technology (DLT) provider.\n\nBy @Tanzeel_Akhtar \n\nhttps://t.co/01mQ9aIS4p https://t.co/GAYDJJUxg8", "Interested in advising your clients on #bitcoin, but don't know where to start?\n\nFrom a compliance checklist to the top crypto advisors to follow, here's a toolkit to get started. We go in depth at #BitcoinForAdvisors on Oct. 6.\n\nRead the Advisor Toolkit: https://t.co/Kbet5wjlto https://t.co/R6kMQs0QXH", "Games maker @animocabrands has agreed to acquire a majority stake in the NFT creators platform @BondlyFinance for an undisclosed amount.\nBy @Tanzeel_Akhtar \n\nhttps://t.co/gyvQVqL5b0 https://t.co/K8Km5vD6r3", "LIVE: \"The Hash\" brings you Friday's hottest stories on https://t.co/yHMYaDyzNy: https://t.co/dp4uzNhcul", "The @UKHouseofLords is conducting a public inquiry regarding the implications of a potential U.K. CBDC.\n\nBy @JamieCrawleyCD https://t.co/VVyUTA2XXd https://t.co/FfRhOjR80I", "JUST IN: The Texas State Securities Board is alleging that @CelsiusNetwork’s interest-bearing crypto deposits are unregistered securities.\n\n@realDannyNelson reports\n\nhttps://t.co/OhDVMUKeVZ https://t.co/NrJV8re75B", "SCOOP: @Ripple is hiring staff in London and Singapore to stand up a market-making operation for $XRP.\n\n@willcanny99 reports\n\nhttps://t.co/Pmx46d0Seg https://t.co/ng6YmnpnTy", "RT @mebynetta: @CoinDesk @worldofwomennft @YKarkai @raphfac My favorite project, I love the art, the values and the mission. https://t.co/M…", "https://t.co/O2GDgRrh2R https://t.co/s6awAJyg6o", "Max Schatzow @AdviserCounsel of Stark &amp; Stark Investment Management &amp; Securities focuses on the formation of private investment funds. \n\nHe joins us at #BitcoinForAdvisors with insights on how financial advisors can advise their clients on #bitcoin: https://t.co/YLNLZ8GmAp https://t.co/eMOGrB9UfJ", "Why should investment advisors care about DeFi?\n\n“Because clients are going to ask, and they’re going to want financial advisors to have an answer,” says @TR401  @CoinDesk \n\nhttps://t.co/ZDab9q0p4v https://t.co/H8jqS7lWwL", "LIVE: \"First Mover\" delivers your first global look at the day's actions in the #bitcoin, blockchains and digital assets space.\n\nWatch on https://t.co/yHMYaDyzNy: https://t.co/sJqHLhsGBh", "For the first time, German financial regulator BaFin has approved a security token offering traded on the Bitcoin sidechain Liquid, making @InfiniteFleet publisher @ExordiumHQ's EXOeu token available to German investors.\n\nBy @JamieCrawleyCD https://t.co/pZsAg2YkOG https://t.co/ZX0k0n6Ehk", "\"In five years’ time I am sure that crypto finance will be mainstream, not only in terms of its mass adoption globally, but also in the extent of assets it will cover,\" says Amber Group CEO Michael Wu.\n\nSponsored by @ambergroup_io: https://t.co/IZUmKvACPy https://t.co/ecE35El9ly", "RT @CoinDeskMarkets: Bitcoin $BTC remains in breakout mode, consolidating above $45K support with resistance at $50K into the weekend.\n\nRea…", "NEW: Blockchain is going to reshape financial services in the same way that the internet has reshaped media companies, CMCC Global's Charlie Morris says.\n\n@willcanny99 reports. https://t.co/b4Lr0PnN0x https://t.co/hkzOZUFp5s", ".@BabelFinance's new Singapore unit will be lead by experienced banking executive Shanshan Yu.\n\nBy @egreechee   https://t.co/RNl0dx6cWX https://t.co/suAmwaZXRA", "Bitcoin remains in stasis ahead of next week's Fed decision. Exchanges see record ether outflows, reports @godbole17.\n\nhttps://t.co/UaumHjIv7u https://t.co/MTBsPj4Vzj", "@Conflux_network is working with Shanghai’s Maritime University to test blockchain infrastructure for offshore digital yuan transactions.\n\n@egreechee https://t.co/EY2ews2SGm https://t.co/Djb4aSlRDp", ".@Bybit_Official plans to end Korean language support on its official platforms and social media.\n\nBy @SebSinclair1989 https://t.co/NLPu14Mp9s https://t.co/8aemODBDzZ", "Bitcoin's latest breakout above key resistance is backed by renewed interest from large investors, according to @intotheblock data.\n\nWatch Chart of the Day, sponsored by @cryptocom: https://t.co/1GpXRIR6P1 https://t.co/ldfaSdiKmL", "An auction on the MISO token launchpad built on SushiSwap appears to have been exploited, with the attacker making off with roughly $3 million in ether.\n\n@egreechee reports.\n\nhttps://t.co/Iawvvx7qpk https://t.co/3iiG0dbOux", "El Salvador's public management watchdog is investigating a complaint from a human rights organization over the government's alleged handling of its Bitcoin Law and local bitcoin ATMs.\n\n@sebsinclair1989 reports\n\nhttps://t.co/5U9QLSbdAa https://t.co/xEBKHRVhbV", "A “Partial Amendment to the Income Tax Act” has been introduced in South Korea that seeks to delay the country’s taxation of cryptocurrency gains until 2023.\n\n@sebsinclair1989 reports.\n\nhttps://t.co/dysN1JUHLj https://t.co/QaHxlncE2R", "NEW: @KyberNetwork is launching its automated market maker (AMM) on @avalancheavax with $5.8 million in liquidity mining incentives. $KNC $AVAX\n\n@helenebraunn reports\n\nhttps://t.co/OT530Vtk09 https://t.co/XRQP5xgi11", "Coinbase CEO Brian Armstrong picked a fight with a top U.S. financial regulator in public. This week's Chinese digest breaks down its potential ramifications. 周报：Coinbase与美国监管者公开叫板。\n\nhttps://t.co/Rx2zAr0cYR\n\nBy @DavidPan_1 https://t.co/mbQfWKCmSH", "Thanks for following - all 2 million of you. https://t.co/NbHXGEnVCY", ".@SPGlobalRatings said that bitcoin adoption could deter El Salvador from participating in an @IMFNews support program, increase financial weaknesses and impair banks by generating currency mismatches when they look to loan money.\n\n@JPRubin23 reports\n\nhttps://t.co/4TxLRFbDvR https://t.co/GMImjgOlA7", "\"The next five years are going to be the golden years of investing,\" @jalak of @futurepvc tells CoinDesk TV at @saltconference in New York.  \n\nWatch the full spotlight on crypto's \"inflection point,\" sponsored by @NexoFinance: https://t.co/zHSqYiqNxH https://t.co/zYIQjHilad", "Ahmed Shabana of @parkpinecapital says the firm is 95% focused on Ethereum projects worldwide.\n\n\"We saw 1,200% growth in the crypto market in just Africa - just insane.\"\n\nWatch the full markets segment, sponsored by @Grayscale: https://t.co/zHSqYiqNxH https://t.co/KWyuNg6VI2", "There's a bullish trend on the horizon: Bitcoin has formed a \"golden cross\" near $48,500 on its daily price chart. \n\nWatch Chart of the Day, sponsored by @cryptocom: https://t.co/HohtXG0uar https://t.co/OMlckcGTeZ", "A Bitcoin activist on why he fights on, despite opposition. \n\n\"It is worth giving them the opportunity to understand and discover that bitcoin is not just a currency but a ticket to more justice, transparency and freedom,\" says @RodolfoBits.\n\nOpinion.\n\nhttps://t.co/29swpkEGsn https://t.co/k7lyYKhqLI", "The @USTreasury is focusing on stablecoin growth as it prepares a report for top financial regulators, CoinDesk confirmed.\n\n@nikhileshde reports\n\nhttps://t.co/eJQ4uu7zQd https://t.co/OsYw6p3xhO", ".@CleanSpark_Inc will add 20 high-skilled jobs to the Norcross data center it acquired in August for over $6.5 million. \n\n@Elitanjourno reports\n\nhttps://t.co/QpX1yhYKBR https://t.co/gAE8Db3iPX", "MARKET WRAP: Bitcoin $BTC loses steam as $AVAX rallies; analysts eye macro developments.\n\nhttps://t.co/NFofSPhWwS", "LIVE: \"Community Crypto\" host @bitcoinzay explores how crypto is impacting communities all over the world. \n\nWatch on https://t.co/yHMYaDyzNy: https://t.co/zvFKLA0tff", ".@Mastercard has minted its first non-fungible token (NFT) and has teamed up with AS Roma head coach José Mourinho.\n\n@Nate_DiCamillo reports\n\nhttps://t.co/IVkSABnhxX https://t.co/OQB2uIMeZV", ".@opensea's head of product, Nate Chastain, has resigned following this week's allegations of insider trading. \n\n@lil_smush reports\nhttps://t.co/fjsHm7IFeZ https://t.co/kI3I7oV56v", "LIVE: \"All About Bitcoin\" brings you the latest news on all things related to the top cryptocurrency.\n\nWatch on https://t.co/yHMYaDyzNy: https://t.co/SOiFxxkUC7", "Blockchain social network startup Minds is allocating 25% of the cash on its balance sheet, or around $2.5 million, to buy bitcoin, ether and Circle Yield.\n\nBy @Tanzeel_Akhtar \n\nhttps://t.co/UZR7qglTfN https://t.co/kaZRVW1ZiA", "How ‘World of Women’ Became a Celebrity NFT Phenom\n\n“The mission of my art was always to showcase women, and put them in the spotlight, and bring more diversity into the space,” says @YKarkai, who launched the NFTs with her partner @raphfac.\n\nhttps://t.co/oZn4zQKi3X https://t.co/RTs0BINSCs", "Crypto media collective @forefront__ has raised $2.1 million as it looks to ramp up its coverage of social tokens and DAOs.\n\n@lil_smush reports\n\nhttps://t.co/8CdVeQYLcB https://t.co/eKg5gR9wvJ", "Lunar payloads, asteroid mining, deep space commerce. Where we boldly go, so will crypto.\n\nOpinion @danielgkuhn\nhttps://t.co/rMvicX7bKi https://t.co/n9uT6WQfQE", "Office-sharing giant @WeWork announced U.K.-based digital bank @RevolutApp is its first enterprise member to pay for office space using cryptocurrency. \nBy @Tanzeel_Akhtar \nhttps://t.co/9pdcyoaQeI https://t.co/iUI8wpwGDV", "NEW: @AudiusProject is announcing a fresh slate of celebrity backers, including @katyperry, @TheChainsmokers, @steveaoki and more.\n\n@helenebraunn reports\n\nhttps://t.co/LpJhezT4sN https://t.co/NuIlZOeJrA", "LIVE: The day's biggest stories in crypto and culture hashed out by \"The Hash\" panel.\n\nWatch on https://t.co/yHMYaDyzNy: https://t.co/7lFOjOCV4m", "Our #BitcoinForAdvisors speaker @MichaelKitces is a 2010 recipient of the Financial Planning Association’s “Heart of Financial Planning” awards for his dedication to advancing the profession. \n\nHe joins @TR401 live on Oct. 6.\n\nRegister: https://t.co/YLNLZ8GmAp https://t.co/RMth9Uyp4N", "NEW: Nashville's @mysolomusic is launching on @solana as a marketplace for musicians to monetize their work as NFTs and more.\n\n@JamieCrawleyCD reports\n\nhttps://t.co/DaCO1gJYgI https://t.co/dyxEw9QTx4", "When it comes to crypto, you’ll need to understand and advise your clients on issues you may never have considered before, @Interaxis8 writes in this week’s Crypto for Advisors newsletter:\n\nhttps://t.co/Jxr5lt9bNV https://t.co/lZI6uSlsCB", "As a financial advisor navigating the complex world of crypto for clients, it’s especially important to have a clear understanding of how each network operates, how new tokens are created and the reason for their unique designs, @jacksonwoodHQ writes:\n\nhttps://t.co/pLCnBYlZeM https://t.co/n3xiYA6tb5", "JUST IN: It’s all about the liquidity as @avalancheavax raises $230 million from @polychaincap, @zhusu's Three Arrows Capital and more to jumpstart the $AVAX DeFi ecosystem.\n\n@Blockanalia reports\n\nhttps://t.co/X00n0vbAdw https://t.co/AHgHxcKak4", "Australian Layer 2 mining network @zktubeofficial has raised $15 million in a funding round led \nby Singapore’s DASH Foundation. \nBy @Tanzeel_Akhtar \n\nhttps://t.co/OyKHlXIEUm https://t.co/2kVz6dNTRv", "Hedera Hashgraph’s rotating governing council of 23 organizations has earmarked 10.7 billion HBAR tokens worth $5 billion to accelerate network adoption.\n\n@godbole17 reports.\n\nhttps://t.co/AhGUDitot6 https://t.co/fLBljWNB7M", "LIVE: Your first look at today's action in the #bitcoin, blockchain and digital asset space.\n\nWatch \"First Mover\" on https://t.co/yHMYaDyzNy: https://t.co/4VjDgAHsYr", "NEW: LayerZero, a team working on secure cross-chain bridges, has emerged from stealth with $6 million in Series A funding led by @multicoincap and @BinanceLabs.\n\n@IanAllison123 reports\n\nhttps://t.co/uK09EbY2oK https://t.co/YD0YjZDCMd", "Music NFT platform @rcrdshp raised more than $5 million in a round of seed financing led by @dapperlabs. \n\nBy @elitanjourno\n \nhttps://t.co/pDe4hVfWms https://t.co/7DZwyFJ95E", "RT @CoinDeskMarkets: Bitcoin $BTC appears overbought on intraday charts, but pullbacks could be limited; resistance at $50K.\n\nRead more: ht…", "The price of Horizen (ZEN) is up 22% after U.S. cryptocurrency exchange Coinbase said it would list the privacy coin.\n\n@LedesmaLyllah reports. \n\nhttps://t.co/WS6fdOAVIq", "Renewed accumulation by whales does not imply immunity for BTC from macro risks. \n\nreports @godbole17\n\nhttps://t.co/UbJJFMBBJQ", "Protesters against El Salvador's acceptance of bitcoin as legal tender torched an automatic teller machine designed to exchange bitcoin for fiat, and carried signs denouncing President Nayib Bukele.\n\n@Sebsinclair1989 and @egreechee report. \n\nhttps://t.co/X5DBFXxjpy https://t.co/J2DewhOAvD", "Following its recent backing by @0xPolygon, @DecentralGames received a strategic investment from @Decentraland to advance the rollout of $ICE Poker.\n\n@JamieCrawleyCD reports. \n\nhttps://t.co/NOwNBck7Lz https://t.co/PKBVtp3axC", "Anthony Scaramucci's SkyBridge Capital has filed for a crypto ETF while also declaring it has raised $100 million out of $250 million for its @Algorand fund during the 2021 SALT conference.\n\n@sebsinclair1989 reports.\n\nhttps://t.co/I4oG4v8FdN https://t.co/hYM740v90z", "Australia's top crypto exchanges say they're not threatened by the bigger players, despite their slow and steady approach.\n\n@BTCMarkets @SwyftxAU @GetCoinJar @CoinSpotau @Krakenfx @Binance @Gemini \n\n@sebsinclair1989 reports\n\nhttps://t.co/G02pBDeaag https://t.co/8raoaE3oxJ", "Australian national Stefan Qin was sentenced to 7 1/2 years in prison for bilking investors in his two hedge funds out of $90 million.\n\nBy @NelWang\nhttps://t.co/Ody5JJA82T https://t.co/vaWCPdRYeX", ".@Coinbase has applied to become a member of the National Futures Association, an early step to listing crypto derivative products.\n\n@nikhileshde, @zackseward and @realDannyNelson report\n\nhttps://t.co/lZqTRUUXQM"]